{
  "navigation": {
    "name": "Devrim ÖKDEM",
    "title": "DevOps Engineer",
    "bio": "Short description, I build accessible, pixel-perfect digital experiences for the web 💻.",
    "Social": {
        "linkedin": "https://www.linkedin.com/",
        "Github": "https://www.github..com/"
    }
  },
  "about": "I am a DevOps Engineer with a strong focus on automating workflows, optimizing cloud infrastructure, and enhancing development pipelines. With experience in tools such as Docker, Kubernetes, Jenkins, and Terraform, I specialize in creating reliable CI/CD processes that speed up delivery and improve system stability. I enjoy bridging the gap between development and operations by fostering a culture of collaboration, continuous improvement, and proactive monitoring. My background spans cloud platforms like AWS and Azure, infrastructure as code, and container orchestration, enabling me to design and maintain highly available, secure, and scalable systems. I am passionate about solving complex problems, reducing manual overhead through automation, and ensuring that applications run efficiently from development to production.",
  "projects": [
    {
      "name": "Portfolio Website",
      "description": "Video course that teaches how to build a web app with the Spotify Web API. Topics covered include the principles of REST APIs, user auth flows, Node, Express, React, Styled Components, and more..",
      "link": "https://example.com",
      "period": {
        "start": "2022-12",
        "end": "2023-02",
        "display": "Dec 2022 - Feb 2023"
      },
      "techs": ["HTML & CSS", "Javascript", "PHP"]
    },
    {
      "name": "Markdown Blog",
      "description": "Web app for visualizing personalized Spotify data. View your top artists, top tracks, recently played tracks, and detailed audio information about each track. Create and save new playlists of recommended tracks based on your existing playlists and more.",
      "link": "https://github.com/janedoe/blog",
      "period": {
        "start": "2022-09",
        "end": "2022-11",
        "display": "Sep - Nov 2022"
      },
      "techs": ["HTML & CSS", "Javascript", "Python"]
    },
    {
      "name": "Wordpress Theme",
      "description": "Collaborated with other student designers and engineers on pro-bono projects to create new brands, design systems, and websites for organizations in the community.",
      "link": "https://github.com/janedoe/blog",
      "period": {
        "start": "2022-09",
        "end": "2022-11",
        "display": "Sep - Nov 2022"
      },
      "techs": ["HTML & CSS", "Javascript", "Python"]
    }
  ],
  "experience": [
    {
      "company": "Tech Corp",
      "role": "Frontend Developer",
      "period": "Jan 2022 - Present",
      "link": "https://techcorp.example.com",
      "description": "Build and maintain critical components used to construct Klaviyo’s frontend, across the whole product. Work closely with cross-functional teams, including developers, designers, and product managers, to implement and advocate for best practices in web accessibility.",
      "techs": ["HTML & CSS", "Javascript", "PHP"]
    },
    {
      "company": "Design Studio",
      "role": "UI Designer",
      "period": "2020 - 2022",
      "link": "https://techcorp.example.com",
      "description": "Build, style, and ship high-quality websites, design systems, mobile apps, and digital experiences for a diverse array of projects for clients including Harvard Business School, Everytown for Gun Safety, Pratt Institute, Koala Health, Vanderbilt University, The 19th News, and more. Provide leadership within engineering department through close collaboration, knowledge shares, and spearheading the development of internal tools.",
      "techs": ["SQL", "Linux", "Windows", "Plesk", "cPanel"]
    }
  ]  
}