{
  "navigation": {
    "name": "Devrim ÖKDEM",
    "title": "DevOps Engineer",
    "bio": "",
    "Social": {
        "linkedin": "https://www.linkedin.com/in/devrimcaner/",
        "Github": "https://github.com/DevrimCaner/"
    }
  },
  "about": "I'm a Software Developer with 5 years of experience in the hosting industry. I've had a passion for computers and games since childhood and that passion evolved into software development. I've worked on various web projects and I'm eager to learn more. I have a passion for creating user-friendly interfaces and software that consumers will love. I am dedicated to examining open-source projects and continuously improving myself by staying up-to-date with emerging technologies. I take pleasure in contributing to team-oriented projects by fulfilling my tasks thoroughly and making valuable contributions with my problem-solving skills.",
  "projects": [
    {
      "name": "BackLogger50",
      "description": "BackLogger50 is an web app for back logging video games which is made with ReactJS and PHP . I made this project for CS50x course final project",
      "link": "https://github.com/DevrimCaner/BackLogger50",
      "period": {
        "start": "2023",
        "end": "2023",
        "display": "Oct 2023"
      },
      "techs": ["HTML & CSS", "Javascript", "PHP", "SQL"]
    },
    {
      "name": "Ecbus.net",
      "description": "I worked as an outsourcer in this project. The project covers all operations of a bus company and includes tracking the locations and engine information of buses. My task was developing the web part of the application. I use Javascript Jquery for frontend and PHP for backend.",
      "link": "#projects",
      "period": {
        "start": "2021",
        "end": "2021",
        "display": "Feb 2021"
      },
      "techs": ["HTML & CSS", "Javascript", "PHP", "SQL"]
    },
    {
      "name": "Personal & Professional Websites",
      "description": "I made some website projects for personal and business use. I made myself a personal website which uses HTML CSS and Javascript. In the business side I made PHP and Jquery based CMS websites for avcimakina.com.tr and eayk.org.",
      "link": "#projects",
      "period": {
        "start": "2020",
        "end": "2021",
        "display": "2020 - 2021"
      },
      "techs": ["HTML & CSS", "Javascript", "PHP", "SQL"]
    },
    {
      "name": "Edge of Coin",
      "description": "This is an hyper casual mobile game which is made by Unity 3D and C#. This project is made for understanding Unity and Android market work.",
      "link": "#projects",
      "period": {
        "start": "2016",
        "end": "2017",
        "display": "Oct 2017"
      },
      "techs": ["Unity", "C#"]
    }
  ],
  "experience": [
    {
      "company": "Maritimetrainer",
      "role": "DevOps Engineer",
      "period": "Feb 2024 - Present",
      "link": "https://maritimetrainer.com/",
      "description": "In this role, I am responsible for managing both online and offline systems by performing updates, installations, and providing support as needed. My responsibilities include automating processes using Bash scripting and Python. Additionally, I leverage my expertise in Linux, PHP-FPM, and MySQL during system updates and installations to ensure smooth and efficient operations.",
      "techs": ["Linux", "Bash", "Pyhton", "PHP"]
    },
    {
      "company": "NiobeHosting",
      "role": "System Support Specialist",
      "period": "2019 - 2024",
      "link": "https://www.niobehosting.com/",
      "description": "In this position my main role is Providing technical support to customers by answering support tickets and phone calls and Fixing the errors checking in Linux, centOS, Windows Server , Plesk , cPanel , DirectAdmin, IceWarp , vmware , hyper-V , PHP , ASP .NET , Wordpress and similar systems. Beside my main role I developed some apps and tools like Windows service App in C# .net and PHP to make our job easier. I improved my communication, problem-solving and Server Management skills in this role .",
      "techs": ["Linux", "Windows", "SQL", "PHP", "C#"]
    }
  ]  
}